src/Documents/Scan_ЗаявкаНаСервисныеРаботы/Scan_ЗаявкаНаСервисныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаСервисныеРаботы</name>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <basedOn>Document.Scan_ЗаявкаПеревозчику</basedOn>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПодтвержденнаяИсполнителем</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведенияРабот</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиВ1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>КодДефекта</name>
      <type>
        <types>CatalogRef.Scan_КодыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Scan_ВидыСервисныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Тахограф</name>
      <type>
        <types>CatalogRef.Scan_ВидыТахографов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОбращенияНаСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказНаряда</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZNN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗаявкаНаСервисныеРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Счет на оплату
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявкаНаСервисныеРаботы";
	//КомандаПечати.Представление = НСтр("ru = 'Заявка на сервисные работы'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявкаНаСервисныеРаботы") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_ЗаявкаНаСервисныеРаботы",
		"Заявка на сервисные работы",
		ПечатьЗаявкаНаДействие(МассивОбъектов, ОбъектыПечати,, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаявкаНаДействие(МассивОбъектов, ОбъектыПечати, ИмяМакета = "ПФ_MXL_ЗаявкаНаСервисныеРаботы", ПараметрыПечати = Неопределено) Экспорт
	
	Scan_СборСтатистики.Scan_Печать(ИмяМакета); // Rarus tenkam 11.04.2022 mantis 18433 +
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПервыйДокумент = Истина;
	
	Если ТипЗнч(МассивОбъектов) = Тип("ДокументСсылка.Scan_ЗаявкаНаСервисныеРаботы") Тогда
	
		мМассивОбъектов = Новый Массив();
		мМассивОбъектов.Добавить(МассивОбъектов);
		МассивОбъектов = мМассивОбъектов;
		
	КонецЕсли;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Зададим параметры макета
		ТабличныйДокумент.ПолеСверху = 0; ТабличныйДокумент.ПолеСлева  = 0;
		ТабличныйДокумент.ПолеСнизу  = 0; ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
		ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ЗаголовокУслуги");
		ОбластьСтрока		= Макет.ПолучитьОбласть("СтрокаУслуги");
		ОбластьПодвал	    = Макет.ПолучитьОбласть("Подвал");
		
		//9428 anch 25/06/2018 +++
		//ОбластьШапка.Параметры.Исполнитель = Документ.Исполнитель.НаименованиеПолное;
		ОбластьШапка.Параметры.Исполнитель = "В" + " " + Документ.Исполнитель.НаименованиеПолное;
        //9428 anch 25/06/2018 ---

		// rarus tenkam 24.07.2018 mantis 9428 +++
		////ОбластьШапка.Параметры.Заголовок = "Заявка № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		//ОбластьШапка.Параметры.Заголовок = "Заявка № " + Документ.НомерДокументаВнутренний + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);  
		
		ОбластьЗаголовокОбщий = Макет.ПолучитьОбласть("Заголовок");
		ОбластьАннулировано   = Макет.ПолучитьОбласть("Аннулировано");
		ОбластьКорректировка  = Макет.ПолучитьОбласть("Корректировка");
		
		Если Документ.Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Аннулирована Тогда
			ТабличныйДокумент.Вывести(ОбластьАннулировано);			
		ИначеЕсли ЗначениеЗаполнено(Документ.НомерДокументаВнутренний) И Документ.НомерДокументаВнутренний <> (Строка(Документ.Номер) + "-" + 1) Тогда    
			ТабличныйДокумент.Вывести(ОбластьКорректировка);
		КонецЕсли;

		ОбластьЗаголовокОбщий.Параметры.Заголовок = "Заявка № " + Документ.НомерДокументаВнутренний + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьЗаголовокОбщий);  		
		// rarus tenkam 24.07.2018 mantis 9428 ---
		
		
		СтоимостьВсего = 0;
		
		ТаблицаРабот = Документ.СоставЗаявки.Выгрузить(, "Работа");
		ТаблицаРабот.Свернуть("Работа");
		
		Для Каждого СтрокаРаботы Из ТаблицаРабот Цикл
		
			НомерСтроки = 1;
		 
			ТекущаяРабота = СтрокаРаботы.Работа;
			ОбластьЗаголовок.Параметры.Услуга = ТекущаяРабота.Наименование;
			// rarus tenkam 21.03.2018 mantis 9428 +++
			АдресФактМестоПроведения = Документ.МестоПроведенияРабот.АдресСкладаФактический;  			
			ОбластьЗаголовок.Параметры.МестоПроведения = АдресФактМестоПроведения;
			// rarus tenkam 21.03.2018 mantis 9428 ---
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			ИзделияРаботы = Документ.СоставЗаявки.НайтиСтроки(Новый Структура("Работа", ТекущаяРабота));
			
			Для каждого СтрокаИзделия Из ИзделияРаботы Цикл
			   								
				ОбластьСтрока.Параметры.НомерСтроки  				= НомерСтроки;
				ОбластьСтрока.Параметры.ТипТСДВСДЭС  				= Строка(СтрокаИзделия.Изделие.ТипПродуктаЛогистический);
				ОбластьСтрока.Параметры.МодельТСДВСДЭС  			= Строка(СтрокаИзделия.Изделие.МодельПродукта); // + " / " + СтрокаИзделия.Изделие.МодельДвигателяТС;     
				ОбластьСтрока.Параметры.НомерШассиНомерДвигателя  	= Строка(СтрокаИзделия.Изделие.VIN);// + " / " + СтрокаИзделия.Изделие.НомерДвигателяТС;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.ДатаВыполненияРабот = Формат(Документ.ПлановаяДатаВыполнения, "ДЛФ=DD");
		ОбластьПодвал.Параметры.Организация = Документ.Организация.НаименованиеПолное;
		ОбластьПодвал.Параметры.Пользователь = "/" + Документ.Автор + "/";
		//rarus tenkam 28.11.2017 mantis 9428 +++
		//ОбластьПодвал.Параметры.ДатаНачалаРабот = Формат(Документ.ДатаНачалаРабот, "ДФ=dd.MM.yyyy");
		ОбластьПодвал.Параметры.ДатаНачалаРабот = Формат(Документ.ДатаНачалаРабот, "ДЛФ=DD");
		//rarus tenkam 28.11.2017 mantis 9428 ---
		ТабличныйДокумент.Вывести(ОбластьПодвал);                          
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для вызова из дополнительной печатной формы.

Процедура ПервоначальноеЗаполнение(ДокументОбъект) Экспорт

	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь() ;
	ДокументОбъект.Организация = ТекущийПользователь.Организация;
	ДокументОбъект.ПодразделениеКомпании = ТекущийПользователь.ПодразделениеОрганизации;
	ДокументОбъект.Автор = ТекущийПользователь;
	ДокументОбъект.Менеджер = ТекущийПользователь;
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
	
	//rarus vikhle 22.04.2020 mt 15695 +++
	Scan_ВспомогательныеФункцииСервер.ЗаполнитьКомпаниюИКонтрагента(ТекущийПользователь,ДокументОбъект.Компания,ДокументОбъект.Контрагент);	
	//rarus vikhle 22.04.2020 mt 15695 ---
КонецПроцедуры


#КонецОбласти

&НаСервере
Функция АннулироватьДокумент(ДополнительныеПараметры) Экспорт 

	// Аннулируем документ
	ДокументОбъект = ДополнительныеПараметры.ПолучитьОбъект();
	ДокументОбъект.Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаРаботы.Аннулирована");
	ДокументОбъект.Записать();

	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

#КонецЕсли

// rarus tenkam 21.03.2018 mantis 9428 +++
Функция ПолучитьПричинуОбращения(ВидРабот = Неопределено, Тахограф = Неопределено, КодДефекта = Неопределено, КодНеисправнойДетали = Неопределено, КаталожныйНомер = "", Количество = 0, Комментарий = "") Экспорт
	
	тВидРабот = ?(ЗначениеЗаполнено(ВидРабот), ВидРабот.Наименование + " ","");
	тТахограф = ?(ЗначениеЗаполнено(Тахограф), Тахограф.Расшифровка + " ", "");
	тКодДефекта = ?(ЗначениеЗаполнено(КодДефекта), КодДефекта.Наименование + " ", "");
	тКодНеисправнойДетали = ?(ЗначениеЗаполнено(КодНеисправнойДетали), КодНеисправнойДетали.Наименование + " ", "");
	тКаталожныйНомер = ?(ЗначениеЗаполнено(КаталожныйНомер), КаталожныйНомер + " ", "");
	тКоличество = ?(ЗначениеЗаполнено(Количество), Строка(Количество) + "шт.", "");
	тКомментарий = ?(ЗначениеЗаполнено(Комментарий), ", " + Комментарий, "");
	
	Возврат СокрЛП(тВидРабот + тТахограф + тКодДефекта + тКодНеисправнойДетали + тКаталожныйНомер + тКоличество) + тКомментарий;	
	
КонецФункции

// rarus tenkam 21.03.2018 mantis 9428 ---
